In [3]:
import pandas as pd
import numpy as np

In [5]:
s1 = np.random.randint(10, size=5)
s2 = np.random.randint(10, size=5)
s3 = np.random.randint(10, size=5)

In [6]:
sozluk = {'var1': s1, 'var2': s2, 'var3': s3}

In [7]:
sozluk

{'var1': array([2, 3, 0, 2, 3]),
 'var2': array([9, 2, 8, 2, 8]),
 'var3': array([7, 3, 1, 7, 5])}

In [8]:
df = pd.DataFrame(sozluk)

In [9]:
df

   var1  var2  var3
0     2     9     7
1     3     2     3
2     0     8     1
3     2     2     7
4     3     8     5

In [10]:
df[0:1]

   var1  var2  var3
0     2     9     7

In [11]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [12]:
df.index = ['a','b','c','d','e']

In [13]:
df

   var1  var2  var3
a     2     9     7
b     3     2     3
c     0     8     1
d     2     2     7
e     3     8     5

In [14]:
df['c':'e']

   var1  var2  var3
c     0     8     1
d     2     2     7
e     3     8     5

In [15]:
df.drop('a', axis=0)

   var1  var2  var3
b     3     2     3
c     0     8     1
d     2     2     7
e     3     8     5

In [16]:
df

   var1  var2  var3
a     2     9     7
b     3     2     3
c     0     8     1
d     2     2     7
e     3     8     5

In [17]:
df.drop('a', axis=0, inplace = True)

In [18]:
df

   var1  var2  var3
b     3     2     3
c     0     8     1
d     2     2     7
e     3     8     5

In [19]:
l = ['c','e']

In [20]:
df.drop(l, axis=0)

   var1  var2  var3
b     3     2     3
d     2     2     7

In [24]:
'var1' in df

True

In [22]:
'b' in df

False

In [23]:
3 in df

False

In [25]:
l = ['var1', 'var4', 'var2']

In [26]:
for i in l:
    print(i in df)

True
False
True

In [27]:
df

   var1  var2  var3
b     3     2     3
c     0     8     1
d     2     2     7
e     3     8     5

In [28]:
df['var1']

b    3
c    0
d    2
e    3
Name: var1, dtype: int64

In [29]:
df['var4'] = df['var1'] / df['var2']

In [30]:
df

   var1  var2  var3   var4
b     3     2     3  1.500
c     0     8     1  0.000
d     2     2     7  1.000
e     3     8     5  0.375

In [31]:
df.drop('var4', axis=1, inplace = True)

In [32]:
df

   var1  var2  var3
b     3     2     3
c     0     8     1
d     2     2     7
e     3     8     5

In [33]:
l = ['var1', 'var2']

In [34]:
df.drop(l,axis=1)

   var3
b     3
c     1
d     7
e     5